tap "antoniorodr/memo"
tap "bysiber/cleardisk"
tap "charmbracelet/tap"
tap "cloudflare/cloudflare"
tap "fwartner/tap"
tap "garethgeorge/backrest-tap"
tap "getsentry/tools"
tap "hashicorp/tap"
tap "hmans/beans"
tap "hudochenkov/sshpass"
tap "infisical/get-cli"
tap "kabel/pecl"
tap "kreuzwerker/taps"
tap "localsend/localsend"
tap "localstack/tap"
tap "music-assistant/tap"
tap "nicoverbruggen/cask"
tap "openhue/cli"
tap "oven-sh/bun"
tap "pulumi/tap"
tap "railwayapp/tap"
tap "siderolabs/tap"
tap "slp/krunkit"
tap "steipete/tap"
tap "stripe/stripe-cli"
tap "stripe/stripe-mock"
tap "supabase/tap"
tap "wix/brew"
# Run your GitHub Actions locally
brew "act"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Swiss-army knife for Android testing and development
brew "adb-enhanced"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Automatic configure script builder
brew "autoconf"
# Collection of over 500 reusable autoconf macros
brew "autoconf-archive"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Translates human-readable Butane Configs into machine-readable Ignition Configs
brew "butane"
# Object-file caching compiler wrapper
brew "ccache"
# Home for the Cluster Management API work, a subproject of sig-cluster-lifecycle
brew "clusterctl"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Dart Language SDK, including the VM, dart2js, core libraries, and more
brew "dart-sdk", link: false
# Load/unload environment variables based on $PWD
brew "direnv"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Text processing system for reStructuredText
brew "docutils"
# Cross-platform library for audio I/O
brew "portaudio"
# Text to speech, software speech synthesizer
brew "espeak"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Easiest way to build and release mobile apps
brew "fastlane"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# CLI for Drive, Gmail, Calendar, Sheets, Docs, Chat, Admin, and more
brew "googleworkspace-cli"
# OpenType text shaping engine
brew "harfbuzz"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# Kubernetes package manager
brew "helm"
# Create Helm chart from Kubernetes yaml
brew "helmify"
# Improved top (interactive process viewer)
brew "htop"
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Utility to optimize JPEG files
brew "jpegoptim"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Open source relational database management system
brew "mysql"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Fast, highly customisable system info script
brew "neofetch"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Small build system for use with gyp or CMake
brew "ninja"
# App source + Nix packages + Docker = Image
brew "nixpacks"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# General-purpose speech recognition model
brew "openai-whisper"
# Development kit for the Java programming language
brew "openjdk"
# OpenShift command-line interface tools
brew "openshift-cli"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# PNG file optimizer
brew "optipng"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Your Gateway to Embedded Software Development Excellence
brew "platformio"
# PNG image optimizing utility
brew "pngquant"
# Tool for managing OCI containers and pods
brew "podman"
# Object-relational database system
brew "postgresql@16", restart_service: :changed
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Python interface to Tcl/Tk
brew "python-tk@3.14"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Fast, efficient and secure backup program
brew "restic"
# Rancher Kubernetes Engine, a Kubernetes installer that works everywhere
brew "rke"
# Safe, concurrent, practical language
brew "rust"
# Monitors sleep, wakeup, and idleness of a Mac
brew "sleepwatcher"
# Synchronous multiroom audio player
brew "snapcast"
# Zsh prompt for Astronauts
brew "spaceship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Version control system designed to be a better CVS
brew "subversion"
# Multi-modal AI tool to extract and summarize content
brew "summarize"
# Nodejs-based tool for optimizing SVG vector graphics files
brew "svgo"
# User interface to the TELNET protocol
brew "telnet"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Instant terminal sharing
brew "tmate"
# Terminal multiplexer
brew "tmux"
# Language for application scale JavaScript development
brew "typescript"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# JavaScript package manager
brew "yarn"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# CLI app to manage your Apple Notes and Apple reminders
brew "antoniorodr/memo/memo"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# Utility to export your existing Cloudflare resources as Terraform resources
brew "cloudflare/cloudflare/cf-terraforming"
# Create project directory structures from YAML templates
brew "fwartner/tap/prjct"
# The Sentry Wizard helps you set up your projects with Sentry
brew "getsentry/tools/sentry-wizard"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform", link: false
brew "hudochenkov/sshpass/sshpass"
# The official Infisical CLI
brew "infisical/get-cli/infisical"
# YAML 1.1 serialization for PHP 8.5
brew "kabel/pecl/php-yaml"
# CLI to support with downloading and compiling terraform providers for Mac with M1 chip.
brew "kreuzwerker/taps/m1-terraform-provider-helper"
# Localstack cli packaged using pyinstaller
brew "localstack/tap/localstack-cli"
# OpenHue CLI is a command-line interface for interacting with Philips Hue smart lighting systems
brew "openhue/cli/openhue-cli"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "siderolabs/tap/talosctl"
# A CLI tool to start Linux KVM or macOS Hypervisor framework virtual machines using the libkrun platform.
brew "slp/krunkit/krunkit"
# Send and read iMessage / SMS from the terminal
brew "steipete/tap/imsg"
# Lightning-fast macOS screenshots & AI vision analysis
brew "steipete/tap/peekaboo"
# Fast CLI for Apple Reminders
brew "steipete/tap/remindctl"
# WhatsApp CLI built on whatsmeow
brew "steipete/tap/wacli"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Supabase CLI
brew "supabase/tap/supabase"
# Apple simulator utilities
brew "wix/brew/applesimutils"
# Android SDK component
cask "android-platform-tools"
# Agentic-first issue tracker
cask "hmans/beans/beans"
# Free, open-source macOS app to find and clean developer caches
cask "bysiber/cleardisk/cleardisk"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Launch builds and start simulators from your menu bar
cask "expo-orbit"
# Screenshot software with built-in annotation tools
cask "flameshot"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Visual development platform
cask "flutterflow"
cask "font-hack-nerd-font"
# Professional font editor
cask "fontlab"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Menu Bar app to perform common Home Assistant functions
cask "ha-menu"
# UI for Kubernetes
cask "headlamp"
# Open-source screen recorder built with web technology
cask "kap"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Minimal installer for conda
cask "miniconda"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Programmable solid 3D CAD modeller
cask "openscad"
# Colour picker for colours onscreen
cask "pika"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# System monitor for the menu bar
cask "stats"
# Real time file synchronisation software
cask "syncthing-app"
# E-reader software
cask "tofu"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
mas "Amphetamine", id: 937984704
mas "Gyroflow", id: 6447994244
mas "Home Assistant", id: 1099568401
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "SSH Config Editor", id: 1109319285
mas "Telegram", id: 747648890
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "arcticicestudio.nord-visual-studio-code"
vscode "bierner.markdown-mermaid"
vscode "christian-kohler.npm-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "etienne-lescot.n8n-as-code"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "motion.motion-vscode-extension"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode.makefile-tools"
vscode "opentofu.vscode-opentofu"
vscode "porifa.laravel-intelephense"
vscode "redhat.vscode-yaml"
go "golang.org/x/tools/gopls"
go "github.com/taigrr/spank"
cargo "cargo-nextest"

# Manually appended (brew metadata reports "Not installed" but .app is present)
cask "dbngin"
