# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "nicoverbruggen/cask"

# System
brew "coreutils"
brew "bash"
brew "tree"
brew "wget"
brew "grep"
brew "htop"
brew "prettyping"

# Infrastructure
brew "awscli"

# Media & Images
brew "gifsicle"
brew "imagemagick"
brew "jpegoptim"
brew "libmemcached"
brew "optipng"
brew "ffmpeg"
brew "pngquant"
brew "svgo"

# Development
brew "composer"
brew "dnsmasq", restart_service: true
brew "gcc"
brew "meilisearch"
brew "memcached"
brew "mysql"
brew "nginx", restart_service: true
brew "php", restart_service: true
brew "php@7.4"
brew "redis"
brew "yarn"
brew "zlib"

# Version Control
brew "gh"
brew "git"
brew "hub"
brew "subversion"

# Utilities
brew "trash"
brew "mackup"
brew "mas"
brew "httpie"

# Fonts
cask "font-fira-code"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-source-serif-pro"

# Applications
cask "phpmon"

# App Store
mas "Amphetamine", id: 937984704
mas "DemoRemote", id: 1457425673
mas "Magnet", id: 441258766
mas "Pixelmator Pro", id: 1289583905
mas "The Unarchiver", id: 425424353
mas "Transmit", id: 1436522307
mas "Xcode", id: 497799835
